; domain
(define (domain drone-domain)


(:requirements :strips :typing )


(:types
    person crate food medicine location drone - object
)


(:predicates
    (at ?o - object ?l - location)
    (crate-content ?b - crate ?content - object)
    (person-needs ?p - person ?content - object)
    (person-has ?p - person ?content - object)
    (arm1-free ?d - drone)
    (arm1-load ?d - drone ?b - crate)
    (arm2-free ?d - drone)
    (arm2-load ?d - drone ?b - crate)
)


(:action move-drone
    :parameters (
        ?drone - drone ?origin - location ?destination - location 
    )
    :precondition (and 
        (at ?drone ?origin)
    )
    :effect (and 
        (not (at ?drone ?origin))
        (at ?drone ?destination)
    )
)

(:action grab-arm1
    :parameters (
        ?d - drone ?b - crate ?l - location
    )
    :precondition (and 
        (at ?d ?l)
        (at ?b ?l)
        (arm1-free ?d)
    )
    :effect (and 
        (not (arm1-free ?d))
        (arm1-load ?d ?b)
        (not (at ?b ?l))
    )
)

(:action grab-arm2
    :parameters (
        ?d - drone ?b - crate ?l - location
    )
    :precondition (and 
        (at ?d ?l)
        (at ?b ?l)
        (arm2-free ?d)
    )
    :effect (and 
        (not (arm2-free ?d))
        (arm2-load ?d ?b)
        (not (at ?b ?l))
    )
)

(:action deliver-arm1
    :parameters (
        ?d - drone ?p - person ?b - crate ?content - object ?l - location
    )
    :precondition (and 
        (arm1-load ?d ?b)
        (at ?d ?l)
        (at ?p ?l)
        (crate-content ?b ?content)
        (person-needs ?p ?content)
    )
    :effect (and 
        (not (arm1-load ?d ?b))
        (arm1-free ?d)
        (not (person-needs ?p ?content))
        (person-has ?p ?content)
    )
)

(:action deliver-arm2
    :parameters (
        ?d - drone ?p - person ?b - crate ?content - object ?l - location
    )
    :precondition (and 
        (arm2-load ?d ?b)
        (at ?d ?l)
        (at ?p ?l)
        (crate-content ?b ?content)
        (person-needs ?p ?content)
    )
    :effect (and 
        (not (arm2-load ?d ?b))
        (arm2-free ?d)
        (not (person-needs ?p ?content))
        (person-has ?p ?content)
    )
)


)

; problem
(define (problem drone_problem_d1_r0_l31_p31_c31_g31_ct2)
(:domain drone-domain)
(:objects
	drone1 - drone
	depot - location
	loc1 - location
	loc2 - location
	loc3 - location
	loc4 - location
	loc5 - location
	loc6 - location
	loc7 - location
	loc8 - location
	loc9 - location
	loc10 - location
	loc11 - location
	loc12 - location
	loc13 - location
	loc14 - location
	loc15 - location
	loc16 - location
	loc17 - location
	loc18 - location
	loc19 - location
	loc20 - location
	loc21 - location
	loc22 - location
	loc23 - location
	loc24 - location
	loc25 - location
	loc26 - location
	loc27 - location
	loc28 - location
	loc29 - location
	loc30 - location
	loc31 - location
	crate1 - crate
	crate2 - crate
	crate3 - crate
	crate4 - crate
	crate5 - crate
	crate6 - crate
	crate7 - crate
	crate8 - crate
	crate9 - crate
	crate10 - crate
	crate11 - crate
	crate12 - crate
	crate13 - crate
	crate14 - crate
	crate15 - crate
	crate16 - crate
	crate17 - crate
	crate18 - crate
	crate19 - crate
	crate20 - crate
	crate21 - crate
	crate22 - crate
	crate23 - crate
	crate24 - crate
	crate25 - crate
	crate26 - crate
	crate27 - crate
	crate28 - crate
	crate29 - crate
	crate30 - crate
	crate31 - crate
	food - contents
	medicine - contents
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	person11 - person
	person12 - person
	person13 - person
	person14 - person
	person15 - person
	person16 - person
	person17 - person
	person18 - person
	person19 - person
	person20 - person
	person21 - person
	person22 - person
	person23 - person
	person24 - person
	person25 - person
	person26 - person
	person27 - person
	person28 - person
	person29 - person
	person30 - person
	person31 - person
)
(:init
	(at drone1 depot)
	(arm1-free drone1)
	(arm2-free drone1)
	(at crate1 depot)
	(at crate2 depot)
	(at crate3 depot)
	(at crate4 depot)
	(at crate5 depot)
	(at crate6 depot)
	(at crate7 depot)
	(at crate8 depot)
	(at crate9 depot)
	(at crate10 depot)
	(at crate11 depot)
	(at crate12 depot)
	(at crate13 depot)
	(at crate14 depot)
	(at crate15 depot)
	(at crate16 depot)
	(at crate17 depot)
	(at crate18 depot)
	(at crate19 depot)
	(at crate20 depot)
	(at crate21 depot)
	(at crate22 depot)
	(at crate23 depot)
	(at crate24 depot)
	(at crate25 depot)
	(at crate26 depot)
	(at crate27 depot)
	(at crate28 depot)
	(at crate29 depot)
	(at crate30 depot)
	(at crate31 depot)
	(crate-content crate1 food)
	(crate-content crate2 food)
	(crate-content crate3 food)
	(crate-content crate4 food)
	(crate-content crate5 food)
	(crate-content crate6 food)
	(crate-content crate7 food)
	(crate-content crate8 food)
	(crate-content crate9 food)
	(crate-content crate10 food)
	(crate-content crate11 food)
	(crate-content crate12 food)
	(crate-content crate13 food)
	(crate-content crate14 food)
	(crate-content crate15 food)
	(crate-content crate16 food)
	(crate-content crate17 food)
	(crate-content crate18 food)
	(crate-content crate19 food)
	(crate-content crate20 food)
	(crate-content crate21 food)
	(crate-content crate22 food)
	(crate-content crate23 medicine)
	(crate-content crate24 medicine)
	(crate-content crate25 medicine)
	(crate-content crate26 medicine)
	(crate-content crate27 medicine)
	(crate-content crate28 medicine)
	(crate-content crate29 medicine)
	(crate-content crate30 medicine)
	(crate-content crate31 medicine)
	(at person1 loc1)
	(at person2 loc11)
	(at person3 loc16)
	(at person4 loc30)
	(at person5 loc13)
	(at person6 loc31)
	(at person7 loc2)
	(at person8 loc3)
	(at person9 loc27)
	(at person10 loc5)
	(at person11 loc23)
	(at person12 loc18)
	(at person13 loc6)
	(at person14 loc15)
	(at person15 loc29)
	(at person16 loc20)
	(at person17 loc17)
	(at person18 loc21)
	(at person19 loc16)
	(at person20 loc9)
	(at person21 loc22)
	(at person22 loc20)
	(at person23 loc21)
	(at person24 loc31)
	(at person25 loc8)
	(at person26 loc21)
	(at person27 loc27)
	(at person28 loc13)
	(at person29 loc8)
	(at person30 loc29)
	(at person31 loc9)
	(person-needs person1 food)
	(person-needs person2 food)
	(person-needs person2 medicine)
	(person-needs person3 food)
	(person-needs person4 food)
	(person-needs person5 food)
	(person-needs person8 food)
	(person-needs person9 food)
	(person-needs person10 food)
	(person-needs person11 food)
	(person-needs person11 medicine)
	(person-needs person12 food)
	(person-needs person14 food)
	(person-needs person16 food)
	(person-needs person17 food)
	(person-needs person17 medicine)
	(person-needs person19 food)
	(person-needs person20 food)
	(person-needs person21 food)
	(person-needs person22 food)
	(person-needs person23 food)
	(person-needs person23 medicine)
	(person-needs person24 medicine)
	(person-needs person25 food)
	(person-needs person26 food)
	(person-needs person27 food)
	(person-needs person27 medicine)
	(person-needs person29 medicine)
	(person-needs person30 food)
	(person-needs person30 medicine)
	(person-needs person31 medicine)
)
(:goal (and
	(at drone1 depot)
	(person-has person1 food)
	(person-has person2 food)
	(person-has person2 medicine)
	(person-has person3 food)
	(person-has person4 food)
	(person-has person5 food)
	(person-has person8 food)
	(person-has person9 food)
	(person-has person10 food)
	(person-has person11 food)
	(person-has person11 medicine)
	(person-has person12 food)
	(person-has person14 food)
	(person-has person16 food)
	(person-has person17 food)
	(person-has person17 medicine)
	(person-has person19 food)
	(person-has person20 food)
	(person-has person21 food)
	(person-has person22 food)
	(person-has person23 food)
	(person-has person23 medicine)
	(person-has person24 medicine)
	(person-has person25 food)
	(person-has person26 food)
	(person-has person27 food)
	(person-has person27 medicine)
	(person-has person29 medicine)
	(person-has person30 food)
	(person-has person30 medicine)
	(person-has person31 medicine)
	))
)

; plan
1. (grab-arm2 drone1 crate26 depot)
   deleted: (arm2-free drone1) (at crate26 depot)
   added: (arm2-load drone1 crate26)
   goals met: 1 of 32
2. (grab-arm1 drone1 crate23 depot)
   deleted: (arm1-free drone1) (at crate23 depot)
   added: (arm1-load drone1 crate23)
   goals met: 1 of 32
3. (move-drone drone1 depot loc23)
   deleted: (at drone1 depot)
   added: (at drone1 loc23)
   goals met: 0 of 32
4. (deliver-arm1 drone1 person11 crate23 medicine loc23)
   deleted: (arm1-load drone1 crate23) (person-needs person11 medicine)
   added: (arm1-free drone1) (person-has person11 medicine)
   goals met: 1 of 32
5. (move-drone drone1 loc23 depot)
   deleted: (at drone1 loc23)
   added: (at drone1 depot)
   goals met: 2 of 32
6. (grab-arm1 drone1 crate24 depot)
   deleted: (arm1-free drone1) (at crate24 depot)
   added: (arm1-load drone1 crate24)
   goals met: 2 of 32
7. (move-drone drone1 depot loc17)
   deleted: (at drone1 depot)
   added: (at drone1 loc17)
   goals met: 1 of 32
8. (deliver-arm1 drone1 person17 crate24 medicine loc17)
   deleted: (arm1-load drone1 crate24) (person-needs person17 medicine)
   added: (arm1-free drone1) (person-has person17 medicine)
   goals met: 2 of 32
9. (move-drone drone1 loc17 depot)
   deleted: (at drone1 loc17)
   added: (at drone1 depot)
   goals met: 3 of 32
10. (grab-arm1 drone1 crate29 depot)
   deleted: (arm1-free drone1) (at crate29 depot)
   added: (arm1-load drone1 crate29)
   goals met: 3 of 32
11. (move-drone drone1 depot loc21)
   deleted: (at drone1 depot)
   added: (at drone1 loc21)
   goals met: 2 of 32
12. (deliver-arm1 drone1 person23 crate29 medicine loc21)
   deleted: (arm1-load drone1 crate29) (person-needs person23 medicine)
   added: (arm1-free drone1) (person-has person23 medicine)
   goals met: 3 of 32
13. (move-drone drone1 loc21 depot)
   deleted: (at drone1 loc21)
   added: (at drone1 depot)
   goals met: 4 of 32
14. (grab-arm1 drone1 crate31 depot)
   deleted: (arm1-free drone1) (at crate31 depot)
   added: (arm1-load drone1 crate31)
   goals met: 4 of 32
15. (move-drone drone1 depot loc31)
   deleted: (at drone1 depot)
   added: (at drone1 loc31)
   goals met: 3 of 32
16. (deliver-arm1 drone1 person24 crate31 medicine loc31)
   deleted: (arm1-load drone1 crate31) (person-needs person24 medicine)
   added: (arm1-free drone1) (person-has person24 medicine)
   goals met: 4 of 32
17. (move-drone drone1 loc31 depot)
   deleted: (at drone1 loc31)
   added: (at drone1 depot)
   goals met: 5 of 32
18. (grab-arm1 drone1 crate25 depot)
   deleted: (arm1-free drone1) (at crate25 depot)
   added: (arm1-load drone1 crate25)
   goals met: 5 of 32
19. (move-drone drone1 depot loc27)
   deleted: (at drone1 depot)
   added: (at drone1 loc27)
   goals met: 4 of 32
20. (deliver-arm1 drone1 person27 crate25 medicine loc27)
   deleted: (arm1-load drone1 crate25) (person-needs person27 medicine)
   added: (arm1-free drone1) (person-has person27 medicine)
   goals met: 5 of 32
21. (move-drone drone1 loc27 depot)
   deleted: (at drone1 loc27)
   added: (at drone1 depot)
   goals met: 6 of 32
22. (grab-arm1 drone1 crate27 depot)
   deleted: (arm1-free drone1) (at crate27 depot)
   added: (arm1-load drone1 crate27)
   goals met: 6 of 32
23. (move-drone drone1 depot loc8)
   deleted: (at drone1 depot)
   added: (at drone1 loc8)
   goals met: 5 of 32
24. (deliver-arm1 drone1 person29 crate27 medicine loc8)
   deleted: (arm1-load drone1 crate27) (person-needs person29 medicine)
   added: (arm1-free drone1) (person-has person29 medicine)
   goals met: 6 of 32
25. (move-drone drone1 loc8 depot)
   deleted: (at drone1 loc8)
   added: (at drone1 depot)
   goals met: 7 of 32
26. (grab-arm1 drone1 crate30 depot)
   deleted: (arm1-free drone1) (at crate30 depot)
   added: (arm1-load drone1 crate30)
   goals met: 7 of 32
27. (move-drone drone1 depot loc29)
   deleted: (at drone1 depot)
   added: (at drone1 loc29)
   goals met: 6 of 32
28. (deliver-arm1 drone1 person30 crate30 medicine loc29)
   deleted: (arm1-load drone1 crate30) (person-needs person30 medicine)
   added: (arm1-free drone1) (person-has person30 medicine)
   goals met: 7 of 32
29. (move-drone drone1 loc29 depot)
   deleted: (at drone1 loc29)
   added: (at drone1 depot)
   goals met: 8 of 32
30. (grab-arm1 drone1 crate28 depot)
   deleted: (arm1-free drone1) (at crate28 depot)
   added: (arm1-load drone1 crate28)
   goals met: 8 of 32
31. (move-drone drone1 depot loc9)
   deleted: (at drone1 depot)
   added: (at drone1 loc9)
   goals met: 7 of 32
32. (deliver-arm1 drone1 person31 crate28 medicine loc9)
   deleted: (arm1-load drone1 crate28) (person-needs person31 medicine)
   added: (arm1-free drone1) (person-has person31 medicine)
   goals met: 8 of 32
33. (move-drone drone1 loc9 depot)
   deleted: (at drone1 loc9)
   added: (at drone1 depot)
   goals met: 9 of 32
34. (move-drone drone1 depot loc11)
   deleted: (at drone1 depot)
   added: (at drone1 loc11)
   goals met: 8 of 32
35. (deliver-arm2 drone1 person2 crate26 medicine loc11)
   deleted: (arm2-load drone1 crate26) (person-needs person2 medicine)
   added: (arm2-free drone1) (person-has person2 medicine)
   goals met: 9 of 32
36. (move-drone drone1 loc11 depot)
   deleted: (at drone1 loc11)
   added: (at drone1 depot)
   goals met: 10 of 32
37. (grab-arm2 drone1 crate9 depot)
   deleted: (arm2-free drone1) (at crate9 depot)
   added: (arm2-load drone1 crate9)
   goals met: 10 of 32
38. (move-drone drone1 depot loc23)
   deleted: (at drone1 depot)
   added: (at drone1 loc23)
   goals met: 9 of 32
39. (deliver-arm2 drone1 person11 crate9 food loc23)
   deleted: (arm2-load drone1 crate9) (person-needs person11 food)
   added: (arm2-free drone1) (person-has person11 food)
   goals met: 10 of 32
40. (move-drone drone1 loc23 depot)
   deleted: (at drone1 loc23)
   added: (at drone1 depot)
   goals met: 11 of 32
41. (grab-arm2 drone1 crate13 depot)
   deleted: (arm2-free drone1) (at crate13 depot)
   added: (arm2-load drone1 crate13)
   goals met: 11 of 32
42. (grab-arm1 drone1 crate6 depot)
   deleted: (arm1-free drone1) (at crate6 depot)
   added: (arm1-load drone1 crate6)
   goals met: 11 of 32
43. (move-drone drone1 depot loc5)
   deleted: (at drone1 depot)
   added: (at drone1 loc5)
   goals met: 10 of 32
44. (deliver-arm2 drone1 person10 crate13 food loc5)
   deleted: (arm2-load drone1 crate13) (person-needs person10 food)
   added: (arm2-free drone1) (person-has person10 food)
   goals met: 11 of 32
45. (move-drone drone1 loc5 loc18)
   deleted: (at drone1 loc5)
   added: (at drone1 loc18)
   goals met: 11 of 32
46. (deliver-arm1 drone1 person12 crate6 food loc18)
   deleted: (arm1-load drone1 crate6) (person-needs person12 food)
   added: (arm1-free drone1) (person-has person12 food)
   goals met: 12 of 32
47. (move-drone drone1 loc18 depot)
   deleted: (at drone1 loc18)
   added: (at drone1 depot)
   goals met: 13 of 32
48. (grab-arm1 drone1 crate17 depot)
   deleted: (arm1-free drone1) (at crate17 depot)
   added: (arm1-load drone1 crate17)
   goals met: 13 of 32
49. (move-drone drone1 depot loc15)
   deleted: (at drone1 depot)
   added: (at drone1 loc15)
   goals met: 12 of 32
50. (deliver-arm1 drone1 person14 crate17 food loc15)
   deleted: (arm1-load drone1 crate17) (person-needs person14 food)
   added: (arm1-free drone1) (person-has person14 food)
   goals met: 13 of 32
51. (move-drone drone1 loc15 depot)
   deleted: (at drone1 loc15)
   added: (at drone1 depot)
   goals met: 14 of 32
52. (grab-arm1 drone1 crate20 depot)
   deleted: (arm1-free drone1) (at crate20 depot)
   added: (arm1-load drone1 crate20)
   goals met: 14 of 32
53. (grab-arm2 drone1 crate16 depot)
   deleted: (arm2-free drone1) (at crate16 depot)
   added: (arm2-load drone1 crate16)
   goals met: 14 of 32
54. (move-drone drone1 depot loc30)
   deleted: (at drone1 depot)
   added: (at drone1 loc30)
   goals met: 13 of 32
55. (move-drone drone1 loc30 loc11)
   deleted: (at drone1 loc30)
   added: (at drone1 loc11)
   goals met: 13 of 32
56. (move-drone drone1 loc11 loc20)
   deleted: (at drone1 loc11)
   added: (at drone1 loc20)
   goals met: 13 of 32
57. (deliver-arm1 drone1 person16 crate20 food loc20)
   deleted: (arm1-load drone1 crate20) (person-needs person16 food)
   added: (arm1-free drone1) (person-has person16 food)
   goals met: 14 of 32
58. (move-drone drone1 loc20 loc17)
   deleted: (at drone1 loc20)
   added: (at drone1 loc17)
   goals met: 14 of 32
59. (deliver-arm2 drone1 person17 crate16 food loc17)
   deleted: (arm2-load drone1 crate16) (person-needs person17 food)
   added: (arm2-free drone1) (person-has person17 food)
   goals met: 15 of 32
60. (move-drone drone1 loc17 depot)
   deleted: (at drone1 loc17)
   added: (at drone1 depot)
   goals met: 16 of 32
61. (grab-arm2 drone1 crate3 depot)
   deleted: (arm2-free drone1) (at crate3 depot)
   added: (arm2-load drone1 crate3)
   goals met: 16 of 32
62. (grab-arm1 drone1 crate7 depot)
   deleted: (arm1-free drone1) (at crate7 depot)
   added: (arm1-load drone1 crate7)
   goals met: 16 of 32
63. (move-drone drone1 depot loc11)
   deleted: (at drone1 depot)
   added: (at drone1 loc11)
   goals met: 15 of 32
64. (deliver-arm2 drone1 person2 crate3 food loc11)
   deleted: (arm2-load drone1 crate3) (person-needs person2 food)
   added: (arm2-free drone1) (person-has person2 food)
   goals met: 16 of 32
65. (move-drone drone1 loc11 loc16)
   deleted: (at drone1 loc11)
   added: (at drone1 loc16)
   goals met: 16 of 32
66. (deliver-arm1 drone1 person19 crate7 food loc16)
   deleted: (arm1-load drone1 crate7) (person-needs person19 food)
   added: (arm1-free drone1) (person-has person19 food)
   goals met: 17 of 32
67. (move-drone drone1 loc16 loc17)
   deleted: (at drone1 loc16)
   added: (at drone1 loc17)
   goals met: 17 of 32
68. (move-drone drone1 loc17 depot)
   deleted: (at drone1 loc17)
   added: (at drone1 depot)
   goals met: 18 of 32
69. (grab-arm1 drone1 crate15 depot)
   deleted: (arm1-free drone1) (at crate15 depot)
   added: (arm1-load drone1 crate15)
   goals met: 18 of 32
70. (move-drone drone1 depot loc9)
   deleted: (at drone1 depot)
   added: (at drone1 loc9)
   goals met: 17 of 32
71. (deliver-arm1 drone1 person20 crate15 food loc9)
   deleted: (arm1-load drone1 crate15) (person-needs person20 food)
   added: (arm1-free drone1) (person-has person20 food)
   goals met: 18 of 32
72. (move-drone drone1 loc9 depot)
   deleted: (at drone1 loc9)
   added: (at drone1 depot)
   goals met: 19 of 32
73. (grab-arm1 drone1 crate8 depot)
   deleted: (arm1-free drone1) (at crate8 depot)
   added: (arm1-load drone1 crate8)
   goals met: 19 of 32
74. (move-drone drone1 depot loc22)
   deleted: (at drone1 depot)
   added: (at drone1 loc22)
   goals met: 18 of 32
75. (deliver-arm1 drone1 person21 crate8 food loc22)
   deleted: (arm1-load drone1 crate8) (person-needs person21 food)
   added: (arm1-free drone1) (person-has person21 food)
   goals met: 19 of 32
76. (move-drone drone1 loc22 depot)
   deleted: (at drone1 loc22)
   added: (at drone1 depot)
   goals met: 20 of 32
77. (grab-arm1 drone1 crate5 depot)
   deleted: (arm1-free drone1) (at crate5 depot)
   added: (arm1-load drone1 crate5)
   goals met: 20 of 32
78. (move-drone drone1 depot loc20)
   deleted: (at drone1 depot)
   added: (at drone1 loc20)
   goals met: 19 of 32
79. (deliver-arm1 drone1 person22 crate5 food loc20)
   deleted: (arm1-load drone1 crate5) (person-needs person22 food)
   added: (arm1-free drone1) (person-has person22 food)
   goals met: 20 of 32
80. (move-drone drone1 loc20 depot)
   deleted: (at drone1 loc20)
   added: (at drone1 depot)
   goals met: 21 of 32
81. (grab-arm1 drone1 crate2 depot)
   deleted: (arm1-free drone1) (at crate2 depot)
   added: (arm1-load drone1 crate2)
   goals met: 21 of 32
82. (move-drone drone1 depot loc21)
   deleted: (at drone1 depot)
   added: (at drone1 loc21)
   goals met: 20 of 32
83. (deliver-arm1 drone1 person23 crate2 food loc21)
   deleted: (arm1-load drone1 crate2) (person-needs person23 food)
   added: (arm1-free drone1) (person-has person23 food)
   goals met: 21 of 32
84. (move-drone drone1 loc21 depot)
   deleted: (at drone1 loc21)
   added: (at drone1 depot)
   goals met: 22 of 32
85. (grab-arm1 drone1 crate21 depot)
   deleted: (arm1-free drone1) (at crate21 depot)
   added: (arm1-load drone1 crate21)
   goals met: 22 of 32
86. (move-drone drone1 depot loc1)
   deleted: (at drone1 depot)
   added: (at drone1 loc1)
   goals met: 21 of 32
87. (deliver-arm1 drone1 person1 crate21 food loc1)
   deleted: (arm1-load drone1 crate21) (person-needs person1 food)
   added: (arm1-free drone1) (person-has person1 food)
   goals met: 22 of 32
88. (move-drone drone1 loc1 loc3)
   deleted: (at drone1 loc1)
   added: (at drone1 loc3)
   goals met: 22 of 32
89. (move-drone drone1 loc3 depot)
   deleted: (at drone1 loc3)
   added: (at drone1 depot)
   goals met: 23 of 32
90. (grab-arm1 drone1 crate12 depot)
   deleted: (arm1-free drone1) (at crate12 depot)
   added: (arm1-load drone1 crate12)
   goals met: 23 of 32
91. (grab-arm2 drone1 crate1 depot)
   deleted: (arm2-free drone1) (at crate1 depot)
   added: (arm2-load drone1 crate1)
   goals met: 23 of 32
92. (move-drone drone1 depot loc16)
   deleted: (at drone1 depot)
   added: (at drone1 loc16)
   goals met: 22 of 32
93. (deliver-arm1 drone1 person3 crate12 food loc16)
   deleted: (arm1-load drone1 crate12) (person-needs person3 food)
   added: (arm1-free drone1) (person-has person3 food)
   goals met: 23 of 32
94. (move-drone drone1 loc16 loc8)
   deleted: (at drone1 loc16)
   added: (at drone1 loc8)
   goals met: 23 of 32
95. (deliver-arm2 drone1 person25 crate1 food loc8)
   deleted: (arm2-load drone1 crate1) (person-needs person25 food)
   added: (arm2-free drone1) (person-has person25 food)
   goals met: 24 of 32
96. (move-drone drone1 loc8 loc23)
   deleted: (at drone1 loc8)
   added: (at drone1 loc23)
   goals met: 24 of 32
97. (move-drone drone1 loc23 loc16)
   deleted: (at drone1 loc23)
   added: (at drone1 loc16)
   goals met: 24 of 32
98. (move-drone drone1 loc16 depot)
   deleted: (at drone1 loc16)
   added: (at drone1 depot)
   goals met: 25 of 32
99. (grab-arm1 drone1 crate11 depot)
   deleted: (arm1-free drone1) (at crate11 depot)
   added: (arm1-load drone1 crate11)
   goals met: 25 of 32
100. (grab-arm2 drone1 crate14 depot)
   deleted: (arm2-free drone1) (at crate14 depot)
   added: (arm2-load drone1 crate14)
   goals met: 25 of 32
101. (move-drone drone1 depot loc21)
   deleted: (at drone1 depot)
   added: (at drone1 loc21)
   goals met: 24 of 32
102. (deliver-arm1 drone1 person26 crate11 food loc21)
   deleted: (arm1-load drone1 crate11) (person-needs person26 food)
   added: (arm1-free drone1) (person-has person26 food)
   goals met: 25 of 32
103. (move-drone drone1 loc21 loc27)
   deleted: (at drone1 loc21)
   added: (at drone1 loc27)
   goals met: 25 of 32
104. (deliver-arm2 drone1 person27 crate14 food loc27)
   deleted: (arm2-load drone1 crate14) (person-needs person27 food)
   added: (arm2-free drone1) (person-has person27 food)
   goals met: 26 of 32
105. (move-drone drone1 loc27 depot)
   deleted: (at drone1 loc27)
   added: (at drone1 depot)
   goals met: 27 of 32
106. (grab-arm1 drone1 crate4 depot)
   deleted: (arm1-free drone1) (at crate4 depot)
   added: (arm1-load drone1 crate4)
   goals met: 27 of 32
107. (move-drone drone1 depot loc30)
   deleted: (at drone1 depot)
   added: (at drone1 loc30)
   goals met: 26 of 32
108. (deliver-arm1 drone1 person4 crate4 food loc30)
   deleted: (arm1-load drone1 crate4) (person-needs person4 food)
   added: (arm1-free drone1) (person-has person4 food)
   goals met: 27 of 32
109. (move-drone drone1 loc30 depot)
   deleted: (at drone1 loc30)
   added: (at drone1 depot)
   goals met: 28 of 32
110. (grab-arm1 drone1 crate10 depot)
   deleted: (arm1-free drone1) (at crate10 depot)
   added: (arm1-load drone1 crate10)
   goals met: 28 of 32
111. (grab-arm2 drone1 crate19 depot)
   deleted: (arm2-free drone1) (at crate19 depot)
   added: (arm2-load drone1 crate19)
   goals met: 28 of 32
112. (move-drone drone1 depot loc13)
   deleted: (at drone1 depot)
   added: (at drone1 loc13)
   goals met: 27 of 32
113. (deliver-arm1 drone1 person5 crate10 food loc13)
   deleted: (arm1-load drone1 crate10) (person-needs person5 food)
   added: (arm1-free drone1) (person-has person5 food)
   goals met: 28 of 32
114. (move-drone drone1 loc13 loc29)
   deleted: (at drone1 loc13)
   added: (at drone1 loc29)
   goals met: 28 of 32
115. (deliver-arm2 drone1 person30 crate19 food loc29)
   deleted: (arm2-load drone1 crate19) (person-needs person30 food)
   added: (arm2-free drone1) (person-has person30 food)
   goals met: 29 of 32
116. (move-drone drone1 loc29 depot)
   deleted: (at drone1 loc29)
   added: (at drone1 depot)
   goals met: 30 of 32
117. (grab-arm1 drone1 crate18 depot)
   deleted: (arm1-free drone1) (at crate18 depot)
   added: (arm1-load drone1 crate18)
   goals met: 30 of 32
118. (grab-arm2 drone1 crate22 depot)
   deleted: (arm2-free drone1) (at crate22 depot)
   added: (arm2-load drone1 crate22)
   goals met: 30 of 32
119. (move-drone drone1 depot loc3)
   deleted: (at drone1 depot)
   added: (at drone1 loc3)
   goals met: 29 of 32
120. (deliver-arm1 drone1 person8 crate18 food loc3)
   deleted: (arm1-load drone1 crate18) (person-needs person8 food)
   added: (arm1-free drone1) (person-has person8 food)
   goals met: 30 of 32
121. (move-drone drone1 loc3 loc27)
   deleted: (at drone1 loc3)
   added: (at drone1 loc27)
   goals met: 30 of 32
122. (deliver-arm2 drone1 person9 crate22 food loc27)
   deleted: (arm2-load drone1 crate22) (person-needs person9 food)
   added: (arm2-free drone1) (person-has person9 food)
   goals met: 31 of 32
123. (move-drone drone1 loc27 depot)
   deleted: (at drone1 loc27)
   added: (at drone1 depot)
   goals met: 32 of 32
